/********************************************************
         Copyright: SDUT 2018-2068
         Author: 王姗姗
         Data:2018-01-14
         Description:查询成员信息
         Email:17853312495@163.com
********************************************************/
#ifndef CHA_H
#define CHA_H
#include "tree.h"
/************************************************************
           fountion:查询成员信息
           in: tree *root   家谱树
               char name[]  查询人的姓名
************************************************************/
int find(tree *root, char name[]);
/************************************************************
           fountion:查询成员孩子信息
           in: tree *root 家谱树
               char parent[] 查询人信息
************************************************************/
int find_parent(tree *root, char parent[]);
/************************************************************
           fountion:查询两个人关系
           in: tree *root   家谱树
               char name1[]  查询人的姓名
			   char name2[]  查询人的姓名
************************************************************/
int find_connect(tree *root, char name1[], char name2[]);
/************************************************************
           fountion:查询同一辈份成员信息
           in: tree *root   家谱树
               int class_num 要查询的辈份
************************************************************/
int find_same(tree *root, int class_num);
/************************************************************
           fountion:初始化各全局变量
************************************************************/
void chu();
/************************************************************
           fountion:输出三代人信息
           in: tree *root   家谱树
               char name[] 查询人的信息
************************************************************/
void find_three(tree *root, char name[]);
/************************************************************
           fountion:查找要删除人信息
           in: tree *root   家谱树
               char name[] 查询人的信息
************************************************************/
tree *find_point(tree *root, char name[]);
#endif
