/********************************************************
         Copyright: SDUT 2018-2068
         Author: 六组
         Data:2018-01-14
         Description:家谱树系统
         Email:17853312495@163.com
********************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "show_main.h"
int main()
{
    printf("\033[34;3;4m******************************************\n\n\033[34;3;4m");
    printf("\033[34;3;4m            欢迎来到家谱管理系统          \n\n\033[34;3;4m");
    printf("\033[34m******************************************\n\n\n\n\n\033[34m");
    printf("\033[34;3;4m***************按ENTER键继续**************\n\033[34;3;4m");
    getchar();
    system("clear");
    show_main();//家谱树展示界面

    return 0;
}

